{
  "Projects": [
    {
      "title": "Full Stack Website",
      "desc": [
        "Developed a full stack blog website using the MERN stack (MongoDB, Express, React, Node.js), with a focus on performance, scalability, and user engagement. Implemented a dynamic content management system with CRUD functionality for blog posts,",
        "User authentication, and role-based access. Integrated a responsive front-end using React and Redux for state management, while the back-end API in Node.js and Express handles data processing and security. Optimized the MongoDB database for efficient data retrieval and used JWT for secure authentication."
      ],
      "year": "2023",
      "preview": "https://www.techblogservice.online/",
      "code": "https://github.com/divyanshsaini962/techblogg",
      "images": [
        "/projects/tech/Home.png",
        "/projects/tech/Blog.png",
        "/projects/tech/page.png"
      ],
      "tech": ["NextJS", "Figma UI", "Tailwind CSS", "Next Auth", "Gemini API"],
      "slug": "tech"
    },
    {
      "title": "Wordpress Website",
      "desc": [
        "Developed a custom WordPress website focused on functionality, user experience, and SEO optimization. Customized themes and plugins to align with the client’s branding and specific requirements. Integrated essential plugins for SEO, security, and performance optimization to ensure fast load times and improved search engine rankings.",
        "Built responsive page layouts to deliver a seamless experience across devices, and used custom post types and taxonomies for easier content management. Provided post-launch support, including tutorials for content updates, ensuring a smooth handover for ongoing site management."
      ],
      "year": "2023",
      "images": [
        "/projects/saku-senyum/Home.png",
        "/projects/saku-senyum/about.png",
        "/projects/saku-senyum/service.png"
      ],
      "tech": [
        "WoresPress",
        "Elementor",
        "Figma UI",
        "Custom CSS"
      ],
      "slug": "saku-senyum"
    },
    {
      "title": "Frontend Website",
      "desc": [
        "This project is a fully responsive, user-friendly website designed using HTML, CSS, and JavaScript. The website features a modern and sleek design that adapts seamlessly to various screen sizes, providing an optimal viewing experience across devices, from desktops and tablets to mobile phones.",
        "Responsive Layout: Built with a mobile-first approach, the layout adjusts dynamically based on the screen size, ensuring a consistent user experience across all devices. Custom CSS Animations: Smooth transitions, hover effects, and animations enhance interactivity, providing users with a visually engaging experience.",
        "JavaScript Interactivity: JavaScript is used to handle dynamic elements, such as forms, modals, and content sliders, making the site interactive and responsive to user actions. Clear and Accessible Navigation: A well-structured navigation menu improves usability, helping users quickly find the content they need."
      ],
      "year": "2022",
      "preview": "https://divyanshsaini962.github.io/sanskarpvcdoor/",
      "code": "https://github.com/divyanshsaini962/sanskarpvcdoor/",
      "images": [
        "/projects/frontend/Home.png",
        "/projects/frontend/gallary.png",
        "/projects/frontend/door.png"
      ],
      "tech": ["HTML", "Custom CSS", "JavaScript", "Figma UI"],
      "slug": "frontend"
    },
    {
      "title": "React Website",
      "desc": [
        "This project is a responsive, high-performance digital marketing agency website developed using React, Next.js, and Tailwind CSS. Designed to showcase digital marketing services effectively. Website combines modern design aesthetics with optimized code to deliver a fast, engaging user experience.",
        "Modern UI/UX Design: The site features a clean and modern design tailored for digital marketing, highlighting services, case studies, and client testimonials. Responsive and Adaptive Layout: Built with Tailwind CSS, the website is fully responsive, offering seamless viewing across all devices, from large desktops to smartphones."
      ],
      "year": "2023",
      "preview": "https://saini-studio.vercel.app/",
      "code": "https://github.com/divyanshsaini962/Saini-studio",
      "images": [
        "/projects/React-website/Home.png",
        "/projects/React-website/Home-2.png",
        "/projects/React-website/Home-3.png",
        "/projects/React-website/Home-4.png"
      ],
      "tech": ["JavaScript", "React", "NextJS", "Tailwind CSS", "Figma UI"],
      "slug": "react-website"
    },
    {
      "title": "React Web App",
      "desc": [
        "To build a fully functional Amazon product price history tracker, start by designing the architecture. The application will have a React frontend for user interaction.",

        "First, set up the backend server with Node.js and Express. This backend will serve as the core API provider for the application, handling requests from the React frontend and communicating with MongoDB to fetch or update price data. Define essential API routes, such as endpoints to fetch price history, update price data, and retrieve product information by product ID or URL.",

        "To store data, integrate MongoDB with the backend server. MongoDB is ideal for this project because it uses a JSON-like document structure, which is flexible for handling product information, including variable pricing details and timestamps. Create a MongoDB collection to store each product’s details. "
      ],
      "year": "2021",
      "preview": "https://saini-price-tracker.vercel.app/",
      "code": "https://github.com/divyanshsaini962/Saini-Price-Tracker",
      "images": [
        "/projects/tools/Home.png",
        "/projects/tools/Home-2.png",
        "/projects/tools/Home-3.png"
        
      ],
      "tech": ["Javascript", "React", "Mongodb","AWS", "TailwindCSS", "Figma UI"],
      "slug": "react-tools"
    },
    {
      "title": "Aleph Discord Bot",
      "desc": [
        "Aleph is a Discord bot that I created for my dircord server to use. The bot is built using Python and the discord.py library. The bot has image grabber feauture that takes argument (keywords) and returns an image from the internet.",
        "Other than that this bot has a few other features such as utility command to delete a messages, and a command to get the server's ping. This bot is still in development and I plan to add more features in the future."
      ],
      "year": "2023",
      "preview": "",
      "code": "https://github.com/Divyanshu/aleph-discord-bot",
      "images": ["/projects/bot/bot1.png", "/projects/bot/bot2.png"],
      "tech": ["Python", "Discord.py", "Google Serp API"],
      "slug": "aleph-discord-bot"
    },
    {
      "title": "LPTK Cup 2023 Website",
      "desc": [
        "LPTK Cup UM is a website that I created for a competition held by  the Universitas Negeri Malang. The website is mainly built using Laravel and Bootstrap. The website has a few features such as a registration form, a login system, article system, file upload,  and a dashboard for the admin to manage the contents.",
        "This project is my second freelance project, this project is not as big as my first freelance project but I learned a lot from this project. I learn how to manage a project and how to work with a team."
      ],
      "year": "2023",
      "preview": "",
      "code": "",
      "images": [
        "/projects/lptk/lptk1.png",
        "/projects/lptk/lptk2.png",
        "/projects/lptk/lptk3.png",
        "/projects/lptk/lptk4.png"
      ],
      "tech": ["PHP", "Laravel", "Bootstrap", "MySQL", "jQuery", "DataTables"],
      "slug": "lptk-cup-2023"
    },
    {
      "title": "NU INO Website",
      "desc": [
        "My first freelance project. This project is a website for a School based on a JALAKAR curriculum. The website is built mainly using Laravel and Bootstrap.",
        "This website is LMS like system, have a user management, user auth, quiz and material for student and FAQ",
        "In this project I learned how to work with a team and how to manage a project. I also learned new library such as livewire and alpine.js."
      ],
      "year": "2023",
      "preview": "",
      "code": "",
      "images": [
        "/projects/ino/ino1.png",
        "/projects/ino/ino2.png",
        "/projects/ino/ino3.png"
      ],
      "tech": [
        "PHP",
        "Laravel",
        "Bootstrap",
        "Livewire",
        "MySQL",
        "jQuery",
        "DataTables"
      ],
      "slug": "nu-ino-website"
    }
  ]
}
